/**
 * 1. Зробити рух гравця по натисканню клавіш
 * 2. Зробити постріли:
 *      - зробити кулю
 *      - зробити рух кулі
 *      - зробити перевірку чи попала куля в ворога чи астероїд
 * 3. Зробити вибір гравця та запуск гри
 * 4. Зробити ворогів та рух ворогів
 * 5. Створити життя
 * 6. Якщо ворог пройшов повз гравця то відняти життя
 * 7. Якщо життя закінчилися то закінчити гру.
 * ***************************************************
 * 
 * 
 * 1. Зробити кількість набраних очок - готово
 * 2. Вивести рахунок на екран - готово
 * 3. Змінювати рахунок після влучання у ворога - готов
 * 4. Зробити зміну швидкості ворогів після збільшення очок (10 збитих ворогів -> швидкість + 5px) готово зменшив збільшення
 * 5*. Зробити бонуси для гравця у грі:
 * — Життя, додає життя - готово

— Вбити всіх ворогів - готово

6*. Зробити створення випадкової кількості ворогів після смерті минулого ворога - готово

7**. Зробити для кожного скіна свій бластер - готов
 
— Кулі вилітають з різних місць - готово

— Додати більше отворів для пострілів - готово

— У кожного літачка свій звук пострілу 

8**. Зробити різні типи ворогів

— Різні скіни - готово

— Різні анімації вибуху - 
 * 
 * 
 */

let app = document.getElementById('game-elements');
let isGameOver = false;
let gameScore = 0; // рахунок гри
let score = document.querySelector('.score span');
let scoreBlock = document.querySelector('.score');
let speedEnemy = 10; 
let asteroidSpeed = 8;





    /**
     * ===========================================
     * функція випадкових чисел від min до max
     * ===========================================
     */
    function random(min, max) {
        // случайное число от min до (max+1)
        let rand = min + Math.random() * (max + 1 - min);
        return Math.floor(rand);
      }

      /*
      =============================================
          Функція збільшення швидкості
      =============================================    
      */
     function speedUp() {if (Number.isInteger (Number(score.innerText) / 10) && Number(score.innerText)){
        speedEnemy += 3;
      };
      };